lib/holiday-stops/src/test/resources/GuardianWeeklyOldSubscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accountId",
  "accountNumber": "accountNumber",
  "accountName": "accountName",
  "invoiceOwnerAccountId": "invoiceOwnerAccountId",
  "invoiceOwnerAccountNumber": "invoiceOwnerAccountNumber",
  "invoiceOwnerAccountName": "invoiceOwnerAccountName",
  "subscriptionNumber": "subscriptionNumber",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2014-01-27",
  "serviceActivationDate": "2014-01-27",
  "customerAcceptanceDate": "2016-10-29",
  "subscriptionStartDate": "2017-01-13",
  "termStartDate": "2019-04-07",
  "termEndDate": "2020-04-07",
  "initialTerm": 84,
  "initialTermPeriodType": "Day",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 26.67,
  "totalContractedValue": 904.14,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "LAA23",
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "CM01",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "Id",
      "lastChangeType": "Add",
      "productId": "productId",
      "productName": "Discounts",
      "productSku": "productSku",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "Id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "number",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "CAD-6.16",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": -6.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-29",
          "effectiveEndDate": "2019-10-30",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -6.160000000,
          "dtcv": -6.160000000,
          "description": "",
          "HolidayStart__c": "2019-10-11",
          "HolidayEnd__c": "2019-10-11",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "Id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0076ae9189c016b080c930a6186",
      "ratePlanName": "DO NOT USE MANUALLY: Guardian Weekly Holiday Credit - automated",
      "ratePlanCharges": [
        {
          "id": "Id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0086ae928d7016b080f638477a6",
          "number": "number",
          "name": "Holiday Credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "CAD-6.16",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": -6.160000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-29",
          "effectiveEndDate": "2019-10-30",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -6.160000000,
          "dtcv": -6.160000000,
          "description": "",
          "HolidayStart__c": "2019-10-04",
          "HolidayEnd__c": "2019-10-04",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "Id",
      "lastChangeType": "Remove",
      "productId": "productId",
      "productName": "Guardian Weekly Zone B",
      "productSku": "ABC-00000019",
      "productRatePlanId": "2c92a0fe57d0a0c40157d74241005544",
      "ratePlanName": "Guardian Weekly Quarterly",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0fd57d0a9230157d75a5e377221",
          "number": "number",
          "name": "Zone B Quarterly",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 4,
          "pricingSummary": "CAD60",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": 60.000000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-10-29",
          "effectiveEndDate": "2019-01-29",
          "processedThroughDate": "2019-01-29",
          "chargedThroughDate": "2019-01-29",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 20.000000000,
          "dmrc": 0E-9,
          "tcv": 540.000000000,
          "dtcv": -45.806451620,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fe6619b4b301661aa494392ee2",
      "ratePlanName": "GW Oct 18 - Quarterly - Domestic",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0fe6619b4b601661aa8b74e623f",
          "number": "number",
          "name": "GW Oct 18 - Quarterly - Domestic",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "pricingSummary": "CAD80",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": 80.000000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-01-29",
          "effectiveEndDate": "2020-04-07",
          "processedThroughDate": "2019-07-29",
          "chargedThroughDate": "2019-10-29",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 26.666666667,
          "dmrc": 0E-9,
          "tcv": 381.075268827,
          "dtcv": 320.000000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fc5b42d2c9015b6259f7f40040",
      "ratePlanName": "Guardian Weekly Holiday Credit",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0ff5b42e3ad015b627c142f072a",
          "number": "number",
          "name": "Holiday Credit",
          "type": "Usage",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "pricingSummary": "CAD0",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": 0E-9,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 2,
          "effectiveStartDate": "2019-04-07",
          "effectiveEndDate": "2019-09-19",
          "processedThroughDate": "2019-09-19",
          "chargedThroughDate": "2019-09-19",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": null,
          "dtcv": null,
          "description": "",
          "HolidayStart__c": "2018-09-19",
          "HolidayEnd__c": "2018-12-12",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fc5b42d2c9015b6259f7f40040",
      "ratePlanName": "Guardian Weekly Holiday Credit",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0ff5b42e3ad015b627c142f072a",
          "number": "number",
          "name": "Holiday Credit",
          "type": "Usage",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "pricingSummary": "CAD0",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": 0E-9,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 2,
          "effectiveStartDate": "2018-04-07",
          "effectiveEndDate": "2018-09-08",
          "processedThroughDate": "2018-09-08",
          "chargedThroughDate": "2018-09-08",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": null,
          "dtcv": null,
          "description": "",
          "HolidayStart__c": "2017-09-08",
          "HolidayEnd__c": "2017-12-05",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0fc5b42d2c9015b6259f7f40040",
      "ratePlanName": "Guardian Weekly Holiday Credit",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "originalChargeId",
          "productRatePlanChargeId": "2c92a0ff5b42e3ad015b627c142f072a",
          "number": "number",
          "name": "Holiday Credit",
          "type": "Usage",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "pricingSummary": "CAD0",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "CAD",
          "price": 0E-9,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 2,
          "effectiveStartDate": "2018-04-07",
          "effectiveEndDate": "2019-04-07",
          "processedThroughDate": "2019-04-07",
          "chargedThroughDate": "2019-04-07",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": null,
          "dtcv": null,
          "description": "",
          "HolidayStart__c": "2018-04-07",
          "HolidayEnd__c": "2018-05-11",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}
